<?php
/*Имеется список учеников и результаты трёх тестов (баллы от 0 до 100).Определить
средний балл каждого ученика по трём тестам, вывести список учеников по
убыванию среднего балла.*/
echo "<h2><b>Результаты экзаменов: </b></h2>";
$students=["Волкова Ирина" => array("Математика"=>rand(0,100),"Физика"=>rand(0,100),"История"=>rand(0,100)),
"Титова Мария" => array("Математика"=>rand(0,100),"Физика"=>rand(0,100),"История"=>rand(0,100)),
"Смирнов Иван" => array("Математика"=>rand(0,100),"Физика"=>rand(0,100),"История"=>rand(0,100)),
"Карасев Мирослав" => array("Математика"=>rand(0,100),"Физика"=>rand(0,100),"История"=>rand(0,100))];

foreach($students as $key=>$val){
	echo "<h4><b>$key</b></h4>";
	$arr=$val;
	$sum=0;
	foreach($arr as $nr =>$val){
		echo "$nr $val<br>";
		$sum+=$val;
	}
	$sr=round($sum/3,2);
	$result[$key]=$sr;
}
arsort($result);

echo "<br><br><b><u>Среднее по всем: </u></b><br>";
foreach ($result as $name =>$num){
	echo "$name = $num<br>";
}
?>
